<template>
  <div class="register-contain">
    <h3 class="text-dark">服務條款 & 隱私權保護政策</h3>
    <div class="box mt-3">
      <h4 class="text-dark">服務條款</h4>
      <p>
        歡迎您造訪 course pro for NTUST（以下簡成為「本網站」），
        為了確保您與本平台的使用體驗與權益，本文件將為您說明本網站的服務條款與隱私權政策，
        當您註冊完成或開始使用本服務時，即表示您已閱讀、了解並同意接受本服務條款之所有內容。如果您不同意本服務條款的內容，
        或者您所屬的國家或地域排除本服務條款內容之全部或部分時，您應立即停止使用本服務。此外，當您使用本服務之特定功能時，
        可能會依據該特定功能之性質，而須遵守本服務所另行公告之服務條款或相關規定。此另行公告之服務條款或相關規定亦均併入屬於本服務條款之一部分。
        本網站有權於任何時間修改或變更本服務條款之內容，並公告於本網站上，請您隨時注意該等修改或變更。若您於任何修改或變更後繼續使用本服務，
        則視為您已閱讀、了解並同意接受該等修改或變更。
        <br /><br />
        若您為未滿二十歲之未成年人，則應請您的父母或監護人閱讀、了解並同意本服務條款之所有內容及其後之修改變更，方得使用本服務。
        當您使用本服務時，即推定您的父母或監護人已閱讀、了解並同意接受本服務條款之所有內容及其後之修改變更。
      </p>

      <h6 class="text-dark">一、隱私權保護</h6>
      <p>
        本網站相當重視隱私權的保護。
        關於您的會員註冊以及其他特定資料，將依本服務「隱私權保護政策」保護與規範。
        您了解並同意當您使用本網站時，本網站可依據「隱私權保護政策」之規範進行您個人資料的蒐集與利用。
        隱私權保護政策適用範圍包括您於本網站上所有輸入資料與任何操作。
      </p>

      <h6 class="text-dark">二、會員註冊條款</h6>
      <p>為了能使用本網站，您同意並承諾以下事項：</p>
      <ol>
        <li>
          依本網站註冊流程之提示提供您本人正確及完整的資料，並維持、更新該資料，確保其為正確、最新及完整。
        </li>
        <li>
          若您提供任何不完整、錯誤或不實的資料，本網站有權暫停或終止您的帳號，並拒絕您使用本服網站之全部或部分。
        </li>
      </ol>
      <p>完成本服務的註冊流程後，即代表您同意並承諾以下事項：</p>
      <ol>
        <li>此帳號係不可轉讓。</li>
        <li>您有責任維持此帳號及密碼的機密安全。</li>
        <li>
          當您的帳號遭到盜用或有其他任何安全問題發生時，您將立即通知本網站管理員。
        </li>
      </ol>

      <h6 class="text-dark">三、使用規範與義務</h6>
      <p>
        除了遵守本服務條款之約定外，您同意遵守中華民國相關法規、本服務其他服務條款，並同意不從事以下行為：
      </p>
      <ol>
        <li>冒用他人名義使用本服務。</li>
        <li>侵害他人名譽、隱私權、著作權、智慧財產權及其他權利。</li>
        <li>
          上載、張貼或公布任何不實、誹謗、侮辱、具威脅性、攻擊性、違背公序良俗、引人犯罪或其他不法之文字、圖片或任何形式的檔案。
        </li>
        <li>違反依法律或契約所應負之保密義務。</li>
        <li>
          上載、張貼或公佈任何含有電腦木馬、病毒或任何對電腦軟、硬體產生中斷、破壞或限制功能之程式碼或資料。
        </li>
        <li>從事任何不法之行為。</li>
        <li>
          破壞及干擾本網站所提供之各項服務，或以任何方式侵入、試圖侵入、破壞本網站之任何系統，或藉由本網站為任何侵害或破壞行為。
        </li>
        <li>未經同意收集他人電子郵件位址或他人個人資料者。</li>
        <li>
          非經許可私自取得、使用本網站未公開之後台資料、API，以達到任何目的者。
        </li>
        <li>
          禁止利用本網站進行一切金錢交易(但不包括本網站所發行之虛擬貨幣)。
        </li>
        <li>禁止利用任何他人製作或自製之腳本程式來操作本網站。</li>
        <li>其他本網站管理員有正當理由認為不適當之行為。</li>
      </ol>
      <p>
        若您有違反前開事項之情事或之虞，本網站有權於通知或未通知之情形下，
        隨時終止或限制您使用帳號（或其任何部分）或服務之使用，並將本服務內任何相關「會員內容」加以移除並刪除。
        您同意若本網站之使用被終止或限制時，本網站對您或任何第三人均不承擔責任。
        <br />
        <br />
        您若係中華民國以外之使用者，並同意遵守所屬國家或地域之相關法規。您同意並保證絕不利用本服務從事違法或損害他人權益之行為。
      </p>

      <h6 class="text-dark">四、不得為商業使用</h6>
      <p>
        您同意並承諾不對本網站提供之任何服務、軟體使用或存取，進行任何商業目的之使用。<br />
        若本網站發現您有任何商業行為，本網站有權於通知或未通知之情形下，隨時終止或限制您使用帳號（或其任何部分）或服務之使用，並保留所有法律追訴權。
      </p>

      <h6 class="text-dark">五、系統中斷或故障</h6>
      <p>
        本網站服務有時可能會出現中斷或故障等現象，
        或許將造成您使用上的不便、資料喪失、錯誤等情形。您於使用本服務時宜自行採取防護措施。
        本網站對於您因使用（或無法使用）服務而造成的損害，不負任何賠償責任。
      </p>

      <h6 class="text-dark">六、與第三方網站之連結及第三方提供之內容</h6>
      <p>
        本網站可能會提供連結至其他網站 （以下稱「第三方」）。
        第三方之網站均由該網站管理單位自行負責，不屬本網站控制及負責範圍之內。
        本網站對任何檢索結果或外部連結，不擔保其有效性、正確性、合適性、及完整性。
        您也許會檢索或連結到一些不合適或不需要的網站，遇此情形時，建議您不要瀏覽或儘速離開該等網站。
        您並同意本網站無須為您連結至前述非屬於本服務之網站所生之任何損害，負損害賠償之責任。對該等內容之正確真偽，
        您宜自行判斷之，本網站對該等內容之正確真偽不負任何責任。您若認為某些內容屬不適宜、侵權或有所不實，請逕向該網站管理單位反應意見。
      </p>

      <h6 class="text-dark">七、服務變更及通知</h6>
      <p>
        您同意本網站保留於任何時間點，不經通知隨時修改、暫時或永久停止繼續提供服務（或其任一部分）的權利。
        如依法或其他相關規定須為通知時，本網站得以包括但不限於：張貼於本服務網頁、電子郵件，或其他現在或未來合理之方式通知您，
        包括本服務條款之變更。但若您違反本服務條款，以未經授權的方式存取本服務，或於註冊時所提供之資料不正確或未更新，您將不會收到前述通知。
        當您經由授權的方式存取本服務，您即同意本網站所為之任何及所有給您的通知，均視為送達。
      </p>

      <h6 class="text-dark">八、智慧財產權的保護</h6>
      <p>
        本服務所使用之程式、軟體及網站內容，包括但不限於：資訊、資料、圖片、檔案、網站架構、網頁設計及會員內容等，
        均由本網站或其他權利人依法擁有其智慧財產權，包括但不限於專利權、著作權與專有技術等。
        任何人不得逕自修改、重製、散布、發行、公開發表、進行還原工程或反向組譯。
        若您欲引用或轉載前述資料，除明確為法律所允許者外，均須依法事前取得本部或其他權利人之書面同意。
        如有違反，您應負損害賠償責任。
      </p>

      <h6 class="text-dark">九、智慧財產權或著作權之侵害處理</h6>
      <p>
        本網站尊重他人之智慧財產權，同樣也要求本網站的使用者尊重他人之智慧財產權。
        本網站得對於可能屬侵權之使用者暫停或終止其使用本網站的權利。若您認為您的著作權或智慧財產權遭受侵害，請提供以下資訊予本服務：
      </p>
      <ol>
        <li>
          您的正確資料與聯絡方式，並有異議情形時，同意將其資料提供給被檢舉人。
        </li>
        <li>能合法代表著作權或智慧財產權利益之所有人之證明。</li>
        <li>
          您所主張受侵害之著作或其他智慧財產權之描述，以及受侵害資料之描述。
        </li>
        <li>您基於善意認為該利用未經著作權人其代理人或法律許可之聲明。</li>
        <li>
          您在了解虛偽陳述之責任的前提下，對於上述載於您的通知上之資訊的正確性之聲明。
        </li>
      </ol>

      <h6 class="text-dark">十、網站對外的相關連結</h6>
      <p>
        當您造訪本網站或使用本網站所提供之功能服務時，
        將視該服務功能的必要性，請您提供必要的個人資料，並在該特定目的範圍內處理及利用您的個人資料；
        非經您書面同意，本網站不會將個人資料用於其他用途。
      </p>

      <h6 class="text-dark">十一、其他</h6>
      <p>
        若有任何未盡事宜，本網站將保留一切更變權益；
        若發生任何法律爭議，本網站與您約定臺灣臺北地方法院為相關爭議調解機關。
      </p>

      <p>最後更新日期：2023/02/19</p>

      <br />
      <h4 class="text-dark">隱私權保護政策</h4>
      <p>
        對於您於course pro for
        NTUST（以下簡成為「本網站」）所提供的一切資料，將以下列條款保護之。
      </p>

      <h6 class="text-dark">一、適用範圍</h6>
      <p>
        本隱私權保護政策適用於您在使用本網站服務過程中，涉及個人資料蒐集、處理、利用與保護之相關作法。
      </p>

      <h6 class="text-dark">二、蒐集的資料類型、蒐集目的及使用方式</h6>
      <p>
        當您於本網站註冊成為使用者時，我們會詢問您的姓名、電子郵件地址等資料；
        為確保您可以正常使用本服務，您同意定期於本網站上更新您的相關資料，以維持相關服務運作；
        您在註冊成為使用者並登入各項服務後，我們將可為您提供相關服務。
        您可以自由選擇是否提供個人資料給我們，但如特定資料欄位係屬必填者，您如不提供該等資料則無法使用相關服務。
        <br />
        <br />
        本網站有權利用您所提供之學校帳號資料進行訪問，以取得相關服務所需之資料，若您不同意本網站訪問您的資料，請立即退出註冊程序。
      </p>

      <h6 class="text-dark">三、個人資料分享政策</h6>
      <p>除非有下列情形，否則本網站不會與第三人分享您的個人資料：</p>
      <ol>
        <li>經由您書面同意。</li>
        <li>法律明文規定。</li>
        <li>為免除您生命、身體、自由或財產上之危險。</li>
        <li>
          與公務機關或學術研究機構合作，基於公共利益為統計或學術研究而有必要，且資料經過提供者處理或蒐集著依其揭露方式無從識別特定之當事人。
        </li>
        <li>
          當您在網站的行為，違反服務條款或可能損害或妨礙網站與其他使用者權益或導致任何人遭受損害時，
          經網站管理單位研析揭露您的個人資料是為了辨識、聯絡或採取法律行動所必要者。
        </li>
        <li>
          司法單位因公眾安全，經合法正式的程序要求本網站公開特定個人資料時，以及對本服務所有使用者安全考量下做必要的配合。
        </li>
      </ol>

      <h6 class="text-dark">四、個人資料使用期間與地區</h6>
      <p>
        本網站服務僅在中華民國境內利用您的個人資料。您在本網站所輸入的個人資料將因應前述蒐集目的永久保存；惟本網站若因服務維運作業需要，保有刪除資料之權利。
      </p>

      <h6 class="text-dark">五、個人資料權利行使方式</h6>
      <ol>
        <li>
          當您在本網站註冊成為使用者後，您可以隨時利用您的帳號和密碼登入本服務對您填寫的個人資料，
          進行查閱、製給複本、補充、更正及刪除。請注意，在您選擇刪除所註冊之帳號後，您將無法再以該帳號登入本服務。
        </li>
        <li>
          若您對第三人所留存本服務間接提供您的個人資料，
          需行使查閱、製給複本、補充、更正及刪除等權利時，請逕洽該第三人辦理。
          您在本服務所自主變更之個人資料，並不即時連動已提供第三人所留存的個人資料。
        </li>
        <li>
          如您為本網站會員，視為您同意本網站隱私權保護政策各項條款，
          本網站將不另外以書面方式徵求您的同意，如您不同意本隱私權保護政策各項條款，
          亦可以隨時利用您的帳號和密碼登入本網站，刪除您的帳號。
        </li>
        <li>
          以下情形，本網站將以停止蒐集、處理或利用個人資料之方式代替刪除個人資料：
        </li>
        <ul>
          <li>有法令規定。</li>
          <li>有契約約定之保存期限。</li>
          <li>有理由說明刪除時將侵害當事人保護利益。</li>
        </ul>
      </ol>

      <h6 class="text-dark">六、Cookie的運用</h6>
      <p>
        Cookies為資訊系統識別使用者而記錄於使用者硬碟之簡短資訊。如果您選擇拒絕使用Cookies，您將無法使用本網站部分服務項目。
        下列情況，本服務會寫入及讀取Cookie：
      </p>
      <ol>
        <li>在您為了進行身分認證而使用。</li>
        <li>
          為統計本服務瀏覽人數、分析用戶瀏覽模式及瀏覽網頁的情況，做為本服務改善服務的參考。
        </li>
        <li>為便利您使用本服務中其他服務項目而需記錄相關資訊時。</li>
        <li>有利於提升本網站服務品質。</li>
      </ol>

      <h6 class="text-dark">七、本網站傳送訊息之方式</h6>
      <p>
        本網站將在您申請成為使用者、參與網站活動或其它已取得您同意的情況下，以電子郵件傳送本網站服務相關資料給您。
      </p>

      <h6 class="text-dark">八、自我保護措施</h6>
      <p>
        本隱私權保護政策將不定期修訂。本網站不會在未經您明確同意的情況下，
        縮減您的權利。隱私權保護政策變更時一律於本網站發布；如屬於重大變更者，
        本網站將搭配主動通知機制，讓您了解本隱私權保護政策所作之變更。
      </p>

      <h6 class="text-dark">九、隱私權保護政策修訂</h6>
      <p>
        本隱私權保護政策將不定期修訂。本網站不會在未經您明確同意的情況下，
        縮減您的權利。隱私權保護政策變更時一律於本網站發布；如屬於重大變更者，
        本網站將搭配主動通知機制，讓您了解本隱私權保護政策所作之變更。
      </p>

      <h6 class="text-dark">十、資訊揭露</h6>
      <p>
        本網站相關開發人員有權接觸您提供的個人資料，
        相關開發人員、服務廠商皆會遵循保密原則，在未經您的同意之下，
        不會向其他無關之第三人透露任何資訊或以您提供的資料訪問任何網站。
      </p>

      <h6 class="text-dark">十一、其他</h6>
      <p>若有任何未盡事宜，本網站將保留一切更變權益。</p>
      <p>最後更新日期：2023/02/19</p>
    </div>
    <div class="w-100 mt-3">
      <el-checkbox v-model="fields.register.accept">
        <span class="text-dark">我已經詳細閱讀並同意上述</span>
        <strong class="text-primary">使用條款&隱私權保護政策</strong>
      </el-checkbox>
    </div>
  </div>
</template>

<script lang="ts">
import { useLoginStore } from "@/store/login";
import { storeToRefs } from "pinia";
import { defineComponent } from "vue";

export default defineComponent({
  setup() {
    const loginStore = useLoginStore();
    const { fields } = storeToRefs(loginStore);
    return {
      fields,
      loginStore,
    };
  },
});
</script>

<style scoped>
.box {
  border: 0.2px rgba(0, 0, 0, 0.3) solid;
  border-radius: 6px;
  width: 100%;
  height: calc(100% - 150px);
  padding: 12px;
  overflow: auto;
}
</style>
